Documents/СписаниеРасходников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>СписаниеРасходников</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиРасходников</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Расходники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Расходник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Расходники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>9</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаСписания</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПричиныСписанияРасходников</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ОстаткиРасходников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиРасходников</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Расходник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Расходники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/СписаниеРасходников/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ОстаткиРасходников.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СписаниеРасходниковРасходники.Расходник КАК Расходник,
		|	СУММА(СписаниеРасходниковРасходники.Количество) КАК Количество,
		|	&Период КАК Период,
		|	&ВидДвижения КАК ВидДвижения
		|ПОМЕСТИТЬ ТЧСписокРасходников
		|ИЗ
		|	Документ.СписаниеРасходников.Расходники КАК СписаниеРасходниковРасходники
		|ГДЕ
		|	СписаниеРасходниковРасходники.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	СписаниеРасходниковРасходники.Расходник
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Расходник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЧСписокРасходников.ВидДвижения КАК ВидДвижения,
		|	ТЧСписокРасходников.Количество КАК Количество,
		|	ТЧСписокРасходников.Период КАК Период,
		|	ТЧСписокРасходников.Расходник КАК Расходник
		|ИЗ
		|	ТЧСписокРасходников КАК ТЧСписокРасходников";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Расход);
	Запрос.УстановитьПараметр("Период", Дата);
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаДвижений = РезультатЗапроса.Выгрузить();
	
	Движения.ОстаткиРасходников.Загрузить(ТаблицаДвижений);
	
	Движения.ОстаткиРасходников.БлокироватьДляИзменения = Истина;

	Движения.Записать();
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиРасходниковОстатки.Расходник КАК Расходник,
		|	ОстаткиРасходниковОстатки.Расходник.Представление КАК РасходникПредставление,
		|	ОстаткиРасходниковОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ОстаткиРасходниковОстатки.Расходник.ЕдиницаИзмерения КАК РасходникЕдиницаИзмерения
		|ИЗ
		|	РегистрНакопления.ОстаткиРасходников.Остатки(
		|			&ДатаОстатков,
		|			Расходник В
		|				(ВЫБРАТЬ
		|					ТЧСписокРасходников.Расходник КАК Расходник
		|				ИЗ
		|					ТЧСписокРасходников КАК ТЧСписокРасходников)) КАК ОстаткиРасходниковОстатки
		|ГДЕ
		|	ОстаткиРасходниковОстатки.КоличествоОстаток < 0";
	
	Запрос.УстановитьПараметр("ДатаОстатков", Новый Граница(МоментВремени(), ВидГраницы.Включая));
	
	Результат = Запрос.Выполнить();

	Если НЕ Результат.Пустой() Тогда
		Отказ = Истина;
		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			Сообщение = Новый СообщениеПользователю;
			ТекстСообщения = СтрШаблон("Недостаточно расходников %1, не хватает: %2 %3", 
										Выборка.РасходникПредставление, -Выборка.КоличествоОстаток, Выборка.РасходникЕдиницаИзмерения);
			Сообщение.Текст = ТекстСообщения;
			Сообщение.Сообщить();
		КонецЦикла;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры
